In [1]:
import pandas as pd

# pandas 기초 데이터 프레임 만들기

In [2]:
two_dimensional = [['dong',50,60],['sieei',60,40],['dsli',56,34],['yioi',45,23]]

In [3]:
my_df = pd.DataFrame(two_dimensional)
my_df

       0   1   2
0   dong  50  60
1  sieei  60  40
2   dsli  56  34
3   yioi  45  23

In [4]:
type(my_df)

pandas.core.frame.DataFrame

In [7]:
my_df = pd.DataFrame(two_dimensional,columns =[ 'name','Korea','math'])
my_df

    name  Korea  math
0   dong     50    60
1  sieei     60    40
2   dsli     56    34
3   yioi     45    23

In [8]:
my_df = pd.DataFrame(two_dimensional,columns=['name','Korea','math'],index=['a','b','c','d'])
my_df

    name  Korea  math
a   dong     50    60
b  sieei     60    40
c   dsli     56    34
d   yioi     45    23

In [9]:
my_df.columns

Index(['name', 'Korea', 'math'], dtype='object')

In [10]:
my_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
my_df.dtypes

name     object
Korea     int64
math      int64
dtype: object

# From list of lists, array of arrays, list of series

In [12]:
import numpy as np
import pandas as pd
two_list = [['dong',50,89],['han',56,23],['jii',45,29],['hihi',89,90]]
two_array = np.array(two_list)
list_of_series = [
    pd.Series(['dong',50,89]),
    pd.Series(['han',56,23]),
    pd.Series(['jii',45,29]),
    pd.Series(['hihi',89,90])
]
# 아래 셋은 모두 동일하다
df1 = pd.DataFrame(two_list)
df2 = pd.DataFrame(two_array)
df3 = pd.DataFrame(list_of_series)
print(df1)
print(df2)
print(df3)

      0   1   2
0  dong  50  89
1   han  56  23
2   jii  45  29
3  hihi  89  90
      0   1   2
0  dong  50  89
1   han  56  23
2   jii  45  29
3  hihi  89  90
      0   1   2
0  dong  50  89
1   han  56  23
2   jii  45  29
3  hihi  89  90

# From dict of lists, dict of arrays, dict of series
## 파이썬 사전으로도 DataFrame을 만들 수 있다.
## 사전의 key로는 column이름을 쓰고 그 column에 해당하는 리스트,numpy array,혹은 pandas Series를 사전의 value로 넣어주면 됩니다.

In [14]:
names = ["gan",'han','hou','ker']
eng_s = [40,20,70,40]
math_s = [90,20,40,50]
dict1 = {
    'name': names,
    'eng': eng_s,
    'math' : math_s
}
dict2 = {
    'name': np.array(names),
    'eng': np.array(eng_s),
    'math' : np.array(math_s)
}
dict3 = {
    'name': pd.Series(names),
    'eng': pd.Series(eng_s),
    'math' : pd.Series(math_s)
}

df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
df3 = pd.DataFrame(dict3)
print(df1)
print(df2)
print(df3)

  name  eng  math
0  gan   40    90
1  han   20    20
2  hou   70    40
3  ker   40    50
  name  eng  math
0  gan   40    90
1  han   20    20
2  hou   70    40
3  ker   40    50
  name  eng  math
0  gan   40    90
1  han   20    20
2  hou   70    40
3  ker   40    50

In [16]:
names = ['TS','AS','HP','JSP']
birthdays = ['D13','J9','J31','F25']
occupations = ['a','b','c','d']
dict = {
    "name" : names,
    "birthday" : birthdays,
    "occupation" : occupations 
}
df = pd.DataFrame(dict)
df

  name birthday occupation
0   TS      D13          a
1   AS       J9          b
2   HP      J31          c
3  JSP      F25          d

In [20]:
arrays = [['TS','D13','a'],['AS','J9','b'],['HP','J31','c'],['JSP','F25','d']]
df = pd.DataFrame(arrays,columns = ['name','birthday','occupation'],index=[0,1,2,3])
df

  name birthday occupation
0   TS      D13          a
1   AS       J9          b
2   HP      J31          c
3  JSP      F25          d

# pandas로 데이터 읽어오기

In [1]:
import pandas as pd

In [10]:
pd.read_csv('house_price.csv',index_col=2) # 컬 2번을 인덱스로

,Unnamed: 0,Unnamed: 0.1,price,built_yr,dong_name,apt_name,size,gu_code,size_pyung,prince_pyung,price_pyung
month,,,,,,,,,,,
202106,0,0,150000,1988,방배동,방배임광,82.34,11650,24.726727,6066.310420,6066.310420
202106,1,1,155000,2003,방배동,삼환나띠르빌(1002-9),148.99,11650,44.741742,3464.326465,3464.326465
202106,2,2,290000,1983,방배동,방배신삼호,185.46,11650,55.693694,5207.052734,5207.052734
202106,3,3,210000,2006,방배동,롯데캐슬헤론,169.08,11650,50.774775,4135.911994,4135.911994
202106,4,4,175000,1992,방배동,대우(효령),84.91,11650,25.498498,6863.149217,6863.149217
...,...,...,...,...,...,...,...,...,...,...,...
202106,191,191,147000,2014,내곡동,서초더샵포레,59.69,11650,17.924925,8200.871168,8200.871168
202106,192,192,160000,2014,내곡동,서초더샵포레,84.81,11650,25.468468,6282.278033,6282.278033
202106,193,193,192500,2014,신원동,서초포레스타5단지,101.35,11650,30.435435,6324.864332,6324.864332
202106,194,194,192500,2014,신원동,서초포레스타5단지,101.35,11650,30.435435,6324.864332,6324.864332
202106,195,195,185000,2014,신원동,서초포레스타5단지,84.41,11650,25.348348,7298.305888,7298.305888